/// \brief 希尔排序
///
/// 一种插入排序，把数据按下标的一定增量分组，对每组使用直接插入排序。
/// 随着增量逐渐减少，每组数据越来越多，当增量减至 1 时，算法终止。
///
/// \author HSDB
/// \date 2018-04-06

/// 第 1  交换 50,10,80,30,70,40,90,60,20  gap=4
/// 第 2  交换 50,10,80,30,20,40,90,60,70  
/// 第 3  交换 20,10,80,30,50,40,90,60,70
/// 第 4  交换 20,10,50,30,80,40,90,60,70  gap=2
/// 第 5  交换 20,10,50,30,80,40,70,60,90
/// 第 6  交换 20,10,50,30,70,40,80,60,90
/// 第 7  交换 20,10,50,30,70,40,80,60,90
/// 第 8  交换 10,20,50,30,70,40,80,60,90  gap=1
/// 第 9  交换 10,20,30,50,70,40,80,60,90
/// 第 10 交换 10,20,30,50,40,70,80,60,90
/// 第 11 交换 10,20,30,40,50,70,80,60,90
/// 第 12 交换 10,20,30,40,50,70,60,80,90
/// 第 13 交换 10,20,30,40,50,60,70,80,90
#include <iostream>
using namespace std;

template <typename T>
void shell_sort(T arr[], const int len){
    for(int gap=len/2;gap>0;gap/=2){
        for(int i=gap;i<len;i++){
            for(int j=i-gap;j>=0 && arr[j]>arr[j+gap];j-=gap){
                swap(arr[j],arr[j+gap]);
            }
        }
    }
}

int main(){
    int arr[]={50,10,90,30,70,40,80,60,20};
    int len=(int) sizeof(arr) / sizeof(*arr);
    shell_sort(arr,len);
    for(auto i:arr){
        cout<<i<<" ";
    }
    cin.get();
    return 0;
}